wosayttn/Gerrit_NuMicro/M2003xI_M2003xJ_Series/Library/StdDriver/src/i2c.c
    return u32txLen;                                                     /* Return bytes length that have been transmitted */
}

/**
  * @brief      Specify a byte register address and write multi bytes to Slave
  *
  * @param[in]  i2c             Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  u8DataAddr      Specify a address (1 byte) of data write to
  * @param[in]  data[]          Pointer to array to write data to Slave
  * @param[in]  u32wLen         How many bytes need to write to Slave
  *
  * @return     A length of how many bytes have been transmitted.
  *
  * @details    The function is used for I2C Master specify a byte address that multi data bytes write to in Slave.
  *             Support one byte or multi bytes.
  *
  */

uint32_t I2C_WriteMultiBytesOneReg(I2C_T *i2c, uint8_t u8SlaveAddr, uint8_t u8DataAddr, uint8_t data[], uint32_t u32wLen)
{
    uint8_t u8Xfering = 1u, u8Err = 0u, u8Ctrl = 0u;
    uint32_t u32txLen = 0u, u32TimeOutCount = 0u;

    g_I2C_i32ErrCode = 0;

    I2C_START(i2c);                                                      /* Send START */
    while(u8Xfering && (u8Err == 0u))
    {
        u32TimeOutCount = I2C_TIMEOUT;
        I2C_WAIT_READY(i2c)
        {
            if (--u32TimeOutCount == 0)
            {
                g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
                u8Err = 1u;
                break;
            }
        }

        switch(I2C_GET_STATUS(i2c))
        {
        case 0x08u:
            I2C_SET_DATA(i2c, (uint8_t)(u8SlaveAddr << 1u | 0x00u));     /* Write SLA+W to Register I2CDAT */
            u8Ctrl = I2C_CTL_SI;
            break;
        case 0x18u:                                                      /* Slave Address ACK */
            I2C_SET_DATA(i2c, u8DataAddr);                               /* Write Lo byte address of register */
            break;
        case 0x20u:                                                      /* Slave Address NACK */
        case 0x30u:                                                      /* Master transmit data NACK */
            u8Ctrl = I2C_CTL_STO_SI;                                     /* Clear SI and send STOP */
            u8Err = 1u;
            break;
        case 0x28u:
            if(u32txLen < u32wLen)
            {
                I2C_SET_DATA(i2c, data[u32txLen++]);
            }
            else
            {
                u8Ctrl = I2C_CTL_STO_SI;                                 /* Clear SI and send STOP */
                u8Xfering = 0u;
            }
            break;
        case 0x38u:                                                      /* Arbitration Lost */
        default:                                                         /* Unknown status */
            I2C_SET_CONTROL_REG(i2c, I2C_CTL_STO_SI);                    /* Clear SI and send STOP */
            u8Ctrl = I2C_CTL_SI;
            u8Err = 1u;
            break;
        }
        I2C_SET_CONTROL_REG(i2c, u8Ctrl);                                /* Write control bit to I2C_CTL register */
    }

    u32TimeOutCount = I2C_TIMEOUT;
    while ((i2c)->CTL0 & I2C_CTL0_STO_Msk)
    {
        if(--u32TimeOutCount == 0)
        {
            g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
            u8Err = 1u;
            break;
        }
    }

    return u32txLen;                                                     /* Return bytes length that have been transmitted */
}

/**
  * @brief      Specify two bytes register address and write multi bytes to Slave
  *
  * @param[in]  i2c             Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  u16DataAddr     Specify a address (2 bytes) of data write to
  * @param[in]  data[]          A data array for write data to Slave
  * @param[in]  u32wLen         How many bytes need to write to Slave
  *
  * @return     A length of how many bytes have been transmitted.
  *
  * @details    The function is used for I2C Master specify two bytes address that multi data write to in Slave.
  *             Support one byte or multi bytes.
  *
  */

uint32_t I2C_WriteMultiBytesTwoRegs(I2C_T *i2c, uint8_t u8SlaveAddr, uint16_t u16DataAddr, uint8_t data[], uint32_t u32wLen)
{
    uint8_t u8Xfering = 1u, u8Err = 0u, u8Addr = 1u, u8Ctrl = 0u;
    uint32_t u32txLen = 0u, u32TimeOutCount = 0U;

    g_I2C_i32ErrCode = 0;

    I2C_START(i2c);                                                      /* Send START */
    while(u8Xfering && (u8Err == 0u))
    {
        u32TimeOutCount = I2C_TIMEOUT;
        I2C_WAIT_READY(i2c)
        {
            if (--u32TimeOutCount == 0)
            {
                g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
                u8Err = 1u;
                break;
            }
        }

        switch(I2C_GET_STATUS(i2c))
        {
        case 0x08u:
            I2C_SET_DATA(i2c, (uint8_t)(u8SlaveAddr << 1u | 0x00u));     /* Write SLA+W to Register I2CDAT */
            u8Ctrl = I2C_CTL_SI;                                         /* Clear SI */
            break;
        case 0x18u:                                                      /* Slave Address ACK */
            I2C_SET_DATA(i2c, (uint8_t)((u16DataAddr & 0xFF00u) >> 8u)); /* Write Hi byte address of register */
            break;
        case 0x20u:                                                      /* Slave Address NACK */
        case 0x30u:                                                      /* Master transmit data NACK */
            u8Ctrl = I2C_CTL_STO_SI;                                     /* Clear SI and send STOP */
            u8Err = 1u;
            break;
        case 0x28u:
            if(u8Addr)
            {
                I2C_SET_DATA(i2c, (uint8_t)(u16DataAddr & 0xFFu));       /* Write Lo byte address of register */
                u8Addr = 0u;
            }
            else if((u32txLen < u32wLen) && (u8Addr == 0u))
            {
                I2C_SET_DATA(i2c, data[u32txLen++]);                     /* Write data to Register I2CDAT*/
            }
            else
            {
                u8Ctrl = I2C_CTL_STO_SI;                                 /* Clear SI and send STOP */
                u8Xfering = 0u;
            }
            break;
        case 0x38u:                                                      /* Arbitration Lost */
        default:                                                         /* Unknown status */
            I2C_SET_CONTROL_REG(i2c, I2C_CTL_STO_SI);                    /* Clear SI and send STOP */
            u8Ctrl = I2C_CTL_SI;
            u8Err = 1u;
            break;
        }
        I2C_SET_CONTROL_REG(i2c, u8Ctrl);                                /* Write control bit to I2C_CTL register */
    }

    u32TimeOutCount = I2C_TIMEOUT;
    while ((i2c)->CTL0 & I2C_CTL0_STO_Msk)
    {
        if(--u32TimeOutCount == 0)
        {
            g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
            u8Err = 1u;
            break;
        }
    }

